config.org
#+TITLE: Emacs Config
#+AUTHOR: Kushan Zaveri

Starting things off...

* Setup

** Configure package sources

Add repositories from which we'll load packages

#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
(add-to-list 'package-archives '("melpa-stable" . "http://stable.melpa.org/packages/"))
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/"))
(setq package-enable-at-startup nil)
#+END_SRC

** Setup `use-package`

#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package)
  (eval-when-compile (require 'use-package)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'use-package)
(setq 
	use-package-always-defer t
	use-package-always-ensure t)
#+END_SRC

** Visuals

*** Spacemacs 

#+BEGIN_SRC emacs-lisp
(use-package spacemacs-theme
  :init (load-theme 'spacemacs-dark t))
#+END_SRC

*** Emacs GUI
    
#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(toggle-scroll-bar -1)
(tool-bar-mode -1)
(add-to-list 'default-frame-alist
             '(font . "Source Code Pro-16"))
#+END_SRC

*** Powerline

#+BEGIN_SRC emacs-lisp
(use-package powerline
	:init (powerline-default-theme))
#+END_SRC

** Extensions

*** Evil Mode

#+BEGIN_SRC emacs-lisp
(use-package evil
	:init (evil-mode t)
	:config	
	(progn 
	    (global-display-line-numbers-mode)
	    (use-package evil-leader
		    :init (global-evil-leader-mode)
		    :config	
		    (progn	
			(evil-leader/set-leader "SPC")
			(evil-leader/set-key
			    "j" 'windmove-down
			    "k" 'windmove-up
			    "h" 'windmove-left
			    "l" 'windmove-right

			    "J" (lambda () (interactive) (split-window-vertically) (windmove-down))
			    "K" (lambda () (interactive) (split-window-vertically))
			    "H" (lambda () (interactive) (split-window-horizontally))
			    "L" (lambda () (interactive) (split-window-horizontally) (windmove-right))

			    "q" 'delete-window)))))
#+END_SRC

*** Flycheck

#+BEGIN_SRC emacs-lisp
(use-package flycheck
	:init (global-flycheck-mode))
#+END_SRC

*** Projectile
    
#+BEGIN_SRC emacs-lisp
(use-package projectile)
#+END_SRC

*** Org Mode

#+BEGIN_SRC emacs-lisp
(use-package org-plus-contrib)
#+END_SRC

*** Ace Window

#+BEGIN_SRC emacs-lisp
(use-package ace-window
	:init (global-set-key (kbd "M-o") 'ace-window))
#+END_SRC
